# ViewDiscipline Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewDiscipline Property
ParameterTypeId Class See Also
---
"Discipline"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewDiscipline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewDiscipline As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewDiscipline {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace